# List
# содержит набор последовательных элементов
# элементы хроняться в той последовотельности в которой были добавленны
# выбрать элемент можно по номеру исчесление идёт с 0

phons = ['iPhone SE (3-го поколения) Год выпуска', 'iPhone 13 Pro Max. Год выпуска: 2021', 'iPhone 13 Pro. Год выпуска: 2021']
print(phons)
print(phons.count('iPhone SE (3-го поколения) Год выпуска')) # просмотр сколько раз элемент входит в список
phons.append('iPhone 13 Pro v1. Год выпуска: 2021') # добовляем элементы в список
print(phons)
print(phons[0]) # вызов элемента по индексу отсчёт с 0 можно вызвать с конца осчёт идёт с -1
print(phons[0:3]) # запросили срез списка
print(phons.index('iPhone 13 Pro Max. Год выпуска: 2021')) # запрост номера индекса
print(phons.sort()) # сортеруем список 
print(phons)
print('iPhone 13 Pro Max. Год выпуска: 2021' in phons) # запрашиваем входит ли элемент в список 
del phons[1] # удаляем элемент в списке по индексу
print(phons)
phons.remove('iPhone 13 Pro Max. Год выпуска: 2021') # удаляем элемент в списке по названию (удаляет первое значение)
print(phons)