
from calendar import c


x = 'привет'   
y = 'Vир'
d = f'{x}  {y}'
 # с = f'{x} {y}' # f строка 
 # print(len(с)) # len длинна символов 
 # print(d.upper()) # upper приводит к верхниму регестру 
 # print(d.lower()) # Приведение к нижнему регистру
 # print(d.capitalize()) # Приводит к верхнему регистру первую букву

x = 'привет    '   
print(x.strip()) # strip уберает пробелы

a = 'Прив3т т3б3'.replace('3','e') # .replace замена (можно строку в целом)
print(a)

a = 'Приветы'.replace('ы',' ') # .replace замена
print(a)

a = 'Приветы'.replace('ы',' ') # .последовательное изминение 
b = a.upper()
print(b)

a = 'Приветы'.replace('ы',' ').upper().lower().capitalize() # .последователная замена в одну строку
print(a)

a = 'Hello work shcool'
print(len(a.split())) # разбиение строк split и уточняем длинну строк. 
 # тип данных None

a = None
b = 0
print(type(a is b)) # определение типа с помощью type.

 # В переменной всегда храниться какое-то значение;
 # у значения есть тип;
 # с разными типами разные действия
 # при написании программы важно понимать, какой тип данны лежит в переменно;type
 # 




